import ImageTextSection from "../ImageTextSection/ImageTextSection";

const WhyFree = () => {
  return (
    <ImageTextSection
      title="Зошто е бесплатно?"
      titleColor="#9F62F8"
      quoteText="Спонзорирани сме од најголемите трговски платформи во светот, затоа нашата услуга е 100% бесплатна."
      imageAlt="Trading expert"
      showQuoteOverlay={true}
    >
      <p>
        Нашата цел е да им помогнеме на што е можно повеќе луѓе да станат финансиски 
        слободни преку дневно тргување или барем да заработуваат дополнителни пари секој 
        ден. Секој треба да има можност да го живее животот од своите соништа, не само 
        финансиски, туку и во однос на контролирање на сопственото време.
      </p>

      <p>
        Сонот на многумина е да работат кога сакаат, од каде сакаат, а дневното тргување е 
        како создадено за овој начин на живот.
      </p>

      <p>
        Ние пронајдовме начин ова да биде бесплатно. Склучивме партнерство со една од 
        најголемите и наградувани трговски платформи во светот. Сè додека сите ја користиме 
        оваа платформа за тргување, 100% од нашите услуги ќе бидат бесплатни за секого!
      </p>

      <p>
        Единствениот критериум е да имате некој капитал за тргување за сè останато ќе ви 
        помогнеме ние, на секој чекор од патот.
      </p>
    </ImageTextSection>
  );
};

export default WhyFree;
