import Image from "next/image";
import whiteLogo from "../../../public/assets/white-logo.png";
// import vantageLogo from "../../../public/assets/vantageLogo.png";

export default function AboutUs() {
  return (
    <div className="bg-[#191C21] text-white p-6 md:p-12">
      <div className="max-w-4xl mx-auto">
        {/* About Section */}
        <div className="flex flex-col items-center justify-center">
          <div style={{ maxHeight: "550px" }} className="mr-0 md:mr-5">
            <Image src={whiteLogo} alt="TradingLab Logo" height={1000} />
          </div>
          <div>
            <h2 className="text-purple-400 text-2xl font-bold mb-4">За нас</h2>
            <p className="text-gray-300 leading-relaxed mb-6">
              Ние сме посветен тим на трговци во форекс со повеќе од 3 години
              искуство во навигација низ глобалните финансиски пазари. Нашата
              експертиза произлегува од долгогодишно практично искуство и
              успешни стратегии. Поседуваме сертификати за успешно завршување на
              различни предизвици, коишто ја потврдуваат нашата вештина и
              способноста постојано да остваруваме профитабилни резултати. Исто
              така, имаме докажана историја на повлекувања од водечки глобални
              брокери, што транспарентно ја покажува нашата веродостојност и
              успех во индустријата. Повеќе од 2 години, сме посветени на
              едукација и оспособување на оние кои сакаат да тргуваат преку
              нашата академија. Без разлика дали сте почетник или искусен
              трговец, нудиме сеопфатна едукација за да ви помогнеме да успеете
              во светот на форекс тргувањето. Нашата академија нуди низа курсеви
              создадени и приспособени да ве опремат со алатки и стратегии
              потребни за успех на пазарот. Покрај нашите едукациски услуги,
              изградивме живописна заедница на трговци кои споделуваат знаења,
              поддршка и увиди. Нашата заедница поддржува соработување,
              овозможувајќи им на членовите заедно да растат и да ги остварат
              своите трговски цели. Нашиот домет се простира подалеку од
              академија и заедница. Активно комуницираме со нашите клиенти и
              публиката која не следи на различни платформи и социјални медиуми,
              вклучувајќи ги Facebook YouTube, Instagram и TikTok. Преку овие
              канали, споделуваме корисни трговски совети, анализи на пазарот и
              ажурирања за да ги информираме и мотивираме нашите следбеници.
              Доколку вашиот избор е: да се едуцирате, тргувате или само да
              останете информирани за новостите на пазарот, ние сме тука за да
              ве поддржиме во секој ваш чекор. Придружете ни се денес и бидете
              дел од нашето растечко трговско семејство.
            </p>
          </div>
        </div>
        {/* Partner Broker Section */}
        {/* <div className="flex flex-col items-center justify-center md:flex-row mt-10">
          <div style={{ maxHeight: "550px" }} className="mr-0 md:mr-5">
            <Image src={vantageLogo} alt="TradingLab Logo" height={430} />
          </div>
          <div>
            <h2 className="text-purple-500 text-2xl font-bold mt-12 mb-4">
              Наш партнер брокер
            </h2>
            <p className="text-gray-300 leading-relaxed mb-6">
              Откријте ја моќта На трејдинг со Vantage Markets - Лиценциран
              Брокер Придружете се на светот на професионални трејдери со
              Vantage Markets, брокерот што ви овозможува повеќе од само
              трејдинг. Одлични услови на пазарот со тесни спредови од 0.0
              пипси, нулта комисија на депозити и сигурност на фондовите преку
              сегрегирани сметки во првокласни банки. Со Vantage, добивате
              пристап до над 1,000+ CFD продукти на различни пазари - форекс,
              акции, индекси, и многу повеќе. Започнете со трејдинг каде и да
              сте, со беспрекорна поддршка на секој чекор! Искористете Ја
              Ексклузивната Понуда За Бонус На Vantage Markets! Започнете со
              трејдинг на Vantage Markets и искористете го нашиот промотивен
              бонус од 50% на вашиот прв депозит. Пример, ако депозирате 500
              евра, ќе добиете дополнителни 250 евра за трејдинг, додека депозит
              од 1,000 евра ви носи целосен бонус од 500 евра! Искористете ја
              оваа можност за уште поголем капитал на вашата трејдинг сметка.
              Промоцијата важи за сите нови клиенти и е одлична шанса за
              зајакнување на вашите инвестициски стратегии со Vantage Markets.
            </p>
          </div>
        </div> */}
      </div>
    </div>
  );
}
