import { useState } from "react";
import { AlumniResults } from "./AlumniResults";

const faqs = [
  {
    question: "Што е Tradinglab MK ?",
    answer:
      "TradingLab MK е заедница на професионални трејдери посветена на едукација, правилно насочување и успех во финансиските пазари. Со претходно изградена академија и докажана стабилност во тргувањето, нашата мисија е да им помогнеме на што повеќе луѓе да го разберат Forex пазарот на вистинскиот начин.Преку структурирана едукација, стратешки насоки и поддршка, ние ги подготвуваме трејдерите за доследен и стабилен успех",
  },
  {
    question: "Што треба да направам за да пристапам до премиум групата?",
    answer:
      "Контактирај не директно на нашите социјални мрежи или пркеу е-маил.",
  },
  {
    question: "Може ли TradingLab MK да ми понуди финансиски совет?",
    answer:
      "Сакаме да ве информираме дека ние “НЕ” сме финансиски советници и “НЕ” можеме да гарантираме за никаква добивка или загуба што може да настане како резултат на вашето тргување или инвестирање. Сето она што го споделуваме со вас е исклучиво за едукативни цели, со цел да ви помогнеме во разбирањето на пазарите и тргувањето. Ве молиме да ги земете во предвид сите ризици поврзани со инвестирањето и да се консултирате со лиценциран финансиски советник пред да донесете било каква финансиска одлука.",
  },
  {
    question: "Дали ми треба искуство за да ги следам сигналите?",
    answer:
      "Не, не ви е потребно никакво претходно искуство! 📈 🔍Сите сигнали доаѓаат со детални насоки чекор по чекор, така што и почетници можат лесно да ги следат. Нашиот тим обезбедува јасни објаснувања за секој потег, помагајќи ви да стекнете знаење и доверба во процесот на тргување.Без разлика дали сте почетник или веќе имате одредено искуство, ние сме тука да ви помогнеме да го совладате Forex на вистинскиот начин! 🚀",
  },
  {
    question:
      "Дали ми треба искуство пред да почнам со следење на академијата ?",
    answer:
      "Не, не ви е потребно никакво претходно искуство! 📚 ✅ Нашата академија е дизајнирана така што секој, без разлика на предзнаењето, може да ја следи и успешно да напредува. Започнуваме од основите, а потоа постепено навлегуваме во напредни стратегии, секогаш со јасни насоки и практични примери.Ако сте почетник, ова е идеалното место да научите Forex на вистинскиот начин! 🚀",
  },
];

const FAQAccordion = () => {
  const [openIndex, setOpenIndex] = useState<number | null>(null);

  const toggleFAQ = (index: number) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <div className="max-w-2xl py-20 mx-auto text-white bg-[#191C21] min-w-full flex flex-col items-center justify-center px-5 md:px-0">
      <h2 className="text-2xl font-bold text-center mb-6">
        Често поставувани прашања
      </h2>
      {faqs.map((faq, index) => (
        <div
          key={index}
          className="border border-purple-500 rounded-xl mb-3 w-full md:w-2/3"
        >
          <button
            className="w-full text-left p-4 flex justify-between items-center"
            onClick={() => toggleFAQ(index)}
          >
            {faq.question}
            <span>{openIndex === index ? "▲" : "▼"}</span>
          </button>
          {openIndex === index && (
            <div className="p-4 border-t border-purple-500">{faq.answer}</div>
          )}
        </div>
      ))}

      <div className="mt-10">
        <AlumniResults />
      </div>
    </div>
  );
};

export default FAQAccordion;
